{
  "_name_or_path": "google/efficientnet-b5",
  "architectures": [
    "EfficientNetForImageClassification"
  ],
  "batch_norm_eps": 0.001,
  "batch_norm_momentum": 0.99,
  "depth_coefficient": 2.2,
  "depth_divisor": 8,
  "depthwise_padding": [
    13,
    27
  ],
  "drop_connect_rate": 0.2,
  "dropout_rate": 0.4,
  "expand_ratios": [
    1,
    6,
    6,
    6,
    6,
    6,
    6
  ],
  "hidden_act": "swish",
  "hidden_dim": 2048,
  "id2label": {
    "0": 0,
    "1": 1,
    "2": 2,
    "3": 3,
    "4": 4
  },
  "image_size": 456,
  "in_channels": [
    32,
    16,
    24,
    40,
    80,
    112,
    192
  ],
  "initializer_range": 0.02,
  "kernel_sizes": [
    3,
    3,
    5,
    3,
    5,
    5,
    3
  ],
  "label2id": {
    "0": 0,
    "1": 1,
    "2": 2,
    "3": 3,
    "4": 4
  },
  "model_type": "efficientnet",
  "num_block_repeats": [
    1,
    2,
    2,
    3,
    3,
    4,
    1
  ],
  "num_channels": 3,
  "num_hidden_layers": 64,
  "out_channels": [
    16,
    24,
    40,
    80,
    112,
    192,
    320
  ],
  "pooling_type": "mean",
  "squeeze_expansion_ratio": 0.25,
  "strides": [
    1,
    2,
    2,
    2,
    1,
    2,
    1
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.40.2",
  "width_coefficient": 1.6
}
